.emacs.d/config.org
* Ivy (Counsel)
#+begin_src emacs-lisp
(use-package counsel
  :straight t
  :after ivy
  :config (counsel-mode))

(use-package ivy
  :straight t
  :custom
  (setq ivy-use-virtual-buffers t)
  (setq ivy-count-format "(%d/%d) ")
  (setq enable-recursive-minibuffers t)
  :config
  (ivy-mode))

(use-package all-the-icons-ivy-rich
  :straight t
  :ensure t
  :init (all-the-icons-ivy-rich-mode 1))

(use-package ivy-rich
  :straight t
  :after ivy
  :ensure t
  :init (ivy-rich-mode 1) ;; this gets us descriptions in M-x.
  :custom
  (ivy-virtual-abbreviate 'full
   ivy-rich-switch-buffer-align-virtual-buffer t
   ivy-rich-path-style 'abbrev)
  :config
  (ivy-set-display-transformer 'ivy-switch-buffer
                               'ivy-rich-switch-buffer-transformer))

#+end_src

* Language Support
Language support ...
#+begin_src emacs-lisp
(use-package python-mode
  :straight t)

(use-package lua-mode
  :straight t)
#+end_src

** LSP Mode
#+begin_src emacs-lisp
(use-package lsp-mode
  :straight t
  :init
  :hook(
    (python-mode . lsp-deferred)
    (c-mode . lsp-deferred)
    (lua-mode . lsp-deferred)
    (lsp-mode . lsp-enable-which-key-integration))
  :commands (lsp lsp-deferred))

(add-to-list 'load-path (expand-file-name "lib/lsp-mode" user-emacs-directory))
(add-to-list 'load-path (expand-file-name "lib/lsp-mode/clients" user-emacs-directory))


(use-package lsp-ui
  :straight t
  :commands lsp-ui-mode)


(use-package lsp-ivy
  :straight t
  :commands lsp-ivy-workspace-symbol)

(use-package lsp-treemacs
  :straight t
  :commands lsp-treemacs-errors-list
  :init
  (lsp-treemacs-sync-mode 1))

(setq lsp-modeline-diagnostics-enable t)
(setq lsp-lenses-enable t)
(setq lsp-headerline-breadcrumb-enable t)
(setq lsp-modeline-code-actions-enable t)
(setq lsp-completion-show-detail t)
(setq lsp-completion-show-kind t)
(setq lsp-ui-sideline-enable t)
#+end_src

* Magit
#+begin_src emacs-lisp
(use-package magit
  :straight t
  :ensure t)
#+end_src

* Org Mode
** Org Bullets
#+begin_src emacs-lisp
(add-hook 'org-mode-hook 'org-indent-mode)
  (use-package org-bullets
    :straight t)
(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
(setq org-bullets-bullet-list '("✙" "♱" "♰" "☥" "✞" "✟" "✝" "†" "✠" "✚" "✜" "✛" "✢" "✣" "✤" "✥"))

#+end_src

** Table of Contents
#+begin_src emacs-lisp
(use-package toc-org
  :straight t
  :commands toc-org-enable
  :init (add-hook 'org-mode-hook 'toc-org-enable))
#+end_src

** Disable Electric Indent
#+begin_src emacs-lisp
(electric-indent-mode -1)
(setq org-edit-src-content-indentation 0)
#+end_src

** Source Code Block Expansion
#+begin_src emacs-lisp
(require 'org-tempo)
#+end_src

* Projectile
#+begin_src emacs-lisp
(use-package projectile
  :straight t
  :config
  (projectile-mode 1))
#+end_src

* Rainbow Mode
#+begin_src emacs-lisp
(use-package rainbow-mode
  :straight t
  :hook org-mode prog-mode)
#+end_src

* Shells and Terminals
** Vterm
#+begin_src emacs-lisp
(use-package vterm
  :straight t
  :config
  (setq shell-file--name "/bin/bash"))

#+end_src
** Vterm-Toggle
#+begin_src emacs-lisp
(use-package vterm-toggle
  :straight t
  :after vterm
  :config
  (setq vterm-toggle-fullscreen-p nil)
  (setq vterm-toggle-scope 'project)
  (add-to-list 'display-buffer-alist
               '((lambda (buffer-or-name _)
                     (let ((buffer (get-buffer buffer-or-name)))
                       (with-current-buffer buffer
                         (or (equal major-mode 'vterm-mode)
                             (string-prefix-p vterm-buffer-name (buffer-name buffer))))))
                  (display-buffer-reuse-window display-buffer-at-bottom)
                  ;;(display-buffer-reuse-window display-buffer-in-direction)
                  ;;display-buffer-in-direction/direction/dedicated is added in emacs27
                  ;;(direction . bottom)
                  ;;(dedicated . t) ;dedicated is supported in emacs27
                  (reusable-frames . visible)
                  (window-height . 0.3))))

#+end_src

* Sudo Edit
#+begin_src emacs-lisp
(use-package sudo-edit
  :straight t
  :config
  (cr4zi/leader-keys
    "fu" '(sudo-edit-find-file :wk "Sudo find file")
    "fU" '(sudo-edit :wk "Sudo edit file")))
#+end_src

* Treemacs
#+begin_src emacs-lisp
(use-package treemacs
  :straight t)

(use-package treemacs-evil
  :straight t
  :after treemacs)

#+end_src

* Themes
** Color theme
Downloaded both to have the option to choose
#+begin_src emacs-lisp
(use-package doom-themes
  :straight t
  :ensure t
  :config
    ;; Global settings (defaults)
    (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
          doom-themes-enable-italic t) ; if nil, italics is universally disabled
    ;; (load-theme 'doom-one t)

    ;; Enable flashing mode-line on errors
    (doom-themes-visual-bell-config)
    ;; Enable custom neotree theme (all-the-icons must be installed!)
    (doom-themes-neotree-config)
    ;; or for treemacs users
    ;; (setq doom-themes-treemacs-theme "doom-atom") ; use "doom-colors" for less minimal icon theme
    ;; (doom-themes-treemacs-config)
    ;; Corrects (and improves) org-mode's native fontification.
    (doom-themes-org-config))

(use-package kaolin-themes
  :straight t
  :ensure t
  :config
  (kaolin-treemacs-theme)
)

(load-theme 'kaolin-dark t)
#+end_src

** Transparency
#+begin_src emacs-lisp
(set-frame-parameter nil 'alpha-background 90)

(add-to-list 'default-frame-alist '(alpha-background . 90))
#+end_src

** Doom Modeline
#+begin_src emacs-lisp
(use-package doom-modeline
  :straight t
  :config
    (setq doom-modeline-height 30)
  :init (doom-modeline-mode 1))
#+end_src

* Which Key
#+begin_src emacs-lisp
(use-package which-key
  :straight t
  :init
  (which-key-mode 1)
  :config
  (setq which-key-side-window-location 'bottom
	which-key-sort-order #'which-key-key-order-alpha
	which-key-allow-imprecise-window-fit nil
	which-key-sort-uppercase-first nil
	which-key-add-column-padding 1
	which-key-max-display-columns nil
	which-key-min-display-lines 6
	which-key-side-window-slot -10
	which-key-side-window-max-height 0.25
	which-key-idle-delay 0.8
	which-key-max-description-length 25
	which-key-allow-imprecise-window-fit nil
	which-key-separator " → " ))
#+end_src
